import React from 'react';
import PhotoCard from '../components/PhotoCard';
import VideoPlayer from '../components/VideoPlayer';
import FeatureHighlights from '../components/FeatureHighlights';

const YourHome: React.FC = () => {
  return (
    <div className="px-6 md:px-12 lg:px-16 py-6 h-full overflow-y-auto">
      <div className="max-w-6xl mx-auto">
        <h1 className="text-2xl font-light mb-8">Твоят дом</h1>
        <PhotoCard image="/houseOutsideView2.jpg" title="Модерни жилищни пространства" description="Създадени с акцент върху простотата и функционалността, нашите жилищни пространства осигуряват максимално естествено осветление и постигат безпроблемна връзка между вътрешната и външната среда. Всяка резиденция се отличава с просторни етажни планове, висококачествени материали и внимателно подбрани детайли, които издигат ежедневието на ново ниво. Архитектурният дизайн набляга на изчистени линии и освободени от излишни елементи пространства, превръщайки домовете във визуално впечатляващи и изключително комфортни убежища." />
        <VideoPlayer videoUrl="/video.mp4" title="ТУИДА" description="Отправете се на пътешествие през нашите внимателно проектирани пространства и усетете хармонията между модерното строителство и природните елементи." />
        <PhotoCard image="/houseOutsideView1.jpg" title="Вътрешни пространства" description="Нашите двуетажни къщи предлагат просторни интериори, които умело разделят зоните за отдих и развлечения от личните пространства. Всеки етаж е оптимизиран за максимален комфорт и функционалност. Обмисленото разпределение на стаите гарантира уединение и спокойствие на горния етаж, докато първият етаж е идеален за социални събирания и семейни дейности, създавайки идеалния баланс за модерен начин на живот." position="left" />
        <PhotoCard image="/housePageBanner.jpg" title="Общи пространства" description="Нашият комплекс предлага внимателно проектирани общи пространства, които насърчават свързването, същевременно зачитайки личното пространство. Озелененият двор осигурява спокойно място за отдих на открито, докато покривната тераса предлага панорамни гледки. Допълнителните удобства включват места за паркиране и спокойни алеи за придвижване. Всеки детайл е обмислен, за да създаде жилищно преживяване, което е едновременно луксозно и практично." />
        <FeatureHighlights />
      </div>
    </div>
  );
};
export default YourHome;